docs/posts/2015-07-08-open-dired-from-shell.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 29, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Open Dired From Shell</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">Open Dired From Shell</h1>
<p class="subtitle" role="doc-subtitle">Jul 08, 2015</p>
</header><p>
I was browsing the interwebs this morning, looking for a way to open a Dired buffer of the current finder window. There is a lot on going the other way, from Emacs to the Finder, but nothing from the Finder to Emacs.
I got this from <a href="http://datko.net/2013/07/11/open-emacs-dired-buffer-from-dired/%20">Fortune Datko</a>:
</p>

<p>
Add this to your shell rc file (in my case, .zshrc):
</p>

<pre class="example" id="orgc6a79ba">
# open a dired window for the current directory
dired() {
    emacsclient -e "(dired \"$PWD\")"
}
</pre>

<p>
Then, assuming that Emacs server is running, type &ldquo;`dired`&rdquo; in the shell, and a Dired
buffer of that directory opens in the current Emacs frame.
</p>

<p>
Just out of curiosity, I wondered what typing &ldquo;`emacsclient -c .`&rdquo; would do. It opens a dired buffer in a new frame. I have a shell script called &ldquo;ec&rdquo; that starts a new emacs client, but it&rsquo;s easy to do it with a zsh alias:
</p>

<pre class="example" id="org5136c50">
alias ec="emacsclient -c -a ''"
</pre>

<p>
This starts a server if there is not one already, then opens a new client. So, typing `ec .` should then open a Dired buffer in a new frame.
</p>


<div class="tagline" id="org08b3f82">
<p>
Tagged: <a href="../tags/emacs.html">Emacs</a> <a href="../tags/shell.html">Shell</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 29, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
